Revit 2026 API

# RibbonPanelAddSeparator Method

---

Adds a new Separator to the panel.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSeparator()
```
```vb
Public Sub AddSeparator
```
```cpp
public:
void AddSeparator()
```
```fsharp
member AddSeparator : unit -> unit
```

The separator won't be shown if there are no items already added to the panel.

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace